# Benzín Brno - TankONO - Natural "95" - pumpa: 'ČS Brno-Hviezdoslavova'
Url: <http://www.tank-ono.cz/cz/index.php?page=cenik>

In [96]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from unicodedata import normalize

# requests - nacte stranku 
url = r'http://www.tank-ono.cz/cz/index.php?page=cenik'
headers = {'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/85.0.4183.102 Safari/537.36'}
r = requests.get(url, headers)
# r.content
# BeautifulSoup - ted nepotrebuji neni JavaScript 
# soup = BeautifulSoup(r.content, 'html.parser')

In [97]:
# pd najde tabulky 
# table_MN = pd.read_html('https://en.wikipedia.org/wiki/Minnesota', match='Election results from statewide races')
table = pd.read_html(r.content, attrs={"class": "cenik"})
print(f'Total tables: {len(table)}')

Total tables: 2

In [98]:
# tabulek je 2, zajima me c. 1
# table[0]
df = table[0]
type(df)

pandas.core.frame.DataFrame

In [99]:
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45 entries, 0 to 44
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  45 non-null     object
 1   (CZK)       45 non-null     object
 2   (CZK).1     45 non-null     object
 3   (CZK).2     45 non-null     object
 4   (CZK).3     45 non-null     object
 5   (CZK).4     45 non-null     object
 6   (CZK).5     45 non-null     object
 7   (CZK).6     45 non-null     object
 8   (CZK).7     45 non-null     object
 9   (CZK).8     45 non-null     object
 10  (CZK).9     45 non-null     object
dtypes: object(11)
memory usage: 4.0+ KB

,Unnamed: 0,(CZK),(CZK).1,(CZK).2,(CZK).3,(CZK).4,(CZK).5,(CZK).6,(CZK).7,(CZK).8,(CZK).9
0,"ČS Plzeň, Domažlická",---,3350,---,3550,3190,3250,990,---,---,---
1,ČS Nýřany,---,3350,---,3550,3190,3250,990,1390,4900,39900
2,"ČS Plzeň, Studentská",---,3350,3390,3550,3190,3250,---,1390,4900,---
3,ČS Sokolov,---,3350,---,3550,3190,3250,990,---,---,---
4,ČS Teplice,---,3350,---,3550,3190,3250,990,---,4900,---

In [100]:
# adding column name to the respective columns - https://bit.ly/3oxfuhN
df.columns =['Name', 'Cena91', 'Cena95', 'Cena95+', 'Cena98', 'CenaD', 'CenaD+', 'CenaAdB', 'CenaLPG', 'CenaM1', 'CenaM2']

In [101]:
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45 entries, 0 to 44
Data columns (total 11 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     45 non-null     object
 1   Cena91   45 non-null     object
 2   Cena95   45 non-null     object
 3   Cena95+  45 non-null     object
 4   Cena98   45 non-null     object
 5   CenaD    45 non-null     object
 6   CenaD+   45 non-null     object
 7   CenaAdB  45 non-null     object
 8   CenaLPG  45 non-null     object
 9   CenaM1   45 non-null     object
 10  CenaM2   45 non-null     object
dtypes: object(11)
memory usage: 4.0+ KB

,Name,Cena91,Cena95,Cena95+,Cena98,CenaD,CenaD+,CenaAdB,CenaLPG,CenaM1,CenaM2
0,"ČS Plzeň, Domažlická",---,3350,---,3550,3190,3250,990,---,---,---
1,ČS Nýřany,---,3350,---,3550,3190,3250,990,1390,4900,39900
2,"ČS Plzeň, Studentská",---,3350,3390,3550,3190,3250,---,1390,4900,---
3,ČS Sokolov,---,3350,---,3550,3190,3250,990,---,---,---
4,ČS Teplice,---,3350,---,3550,3190,3250,990,---,4900,---

In [102]:
Key = 'ČS Brno-Hviezdoslavova'
Radek = df.loc[df['Name'] == Key]
Radek

,Name,Cena91,Cena95,Cena95+,Cena98,CenaD,CenaD+,CenaAdB,CenaLPG,CenaM1,CenaM2
41,ČS Brno-Hviezdoslavova,---,3350,---,3550,3190,3250,990,---,4900,---

In [103]:
# How to get a value from a Pandas DataFrame and not the index and object type - https://bit.ly/3BhmuDc
item =  Radek['Cena95'].values[0]
item

'3350'

In [104]:
# 3350 => 33.50
item =  float(item) / 100
print("item:", item, '|| type:', type(item))
# Cena
Cena = '{:.2f}'.format(item)
print("Cena:", Cena, '|| type:', type(Cena))

item: 33.5 || type: <class 'float'>
Cena: 33.50 || type: <class 'str'>

In [105]:
print('Cena paliva -', Key, '- je:', Cena )

Cena paliva - ČS Brno-Hviezdoslavova - je: 33.50